Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--internationalisation_quickstart.tmx
Source language: en
Languages: ja

source: OSGeoLive Internationalisation Quickstart
ja: OSGeoLive 国際化 クイックスタート

source: Switching Language
ja: 言語の変更

source: Many common languages are included on OSGeoLive. To switch languages:
ja: OSGeoLive は標準で多くの言語に対応しています。言語を切り替えるには以下を実行します:

source: Log out
ja: ログアウトします

source: Select user="user", password="user"
ja: user="user", password="user" でログインします

source: Select another language from the top panel menu.
ja: 画面上部のパネルメニューから別の言語を選択します

source: Press the :guilabel:`Log in` button.
ja: :guilabel:`Log in` ボタンをクリックします

source: Repeat the process if needed or if you wish to change languages again.
ja: ほかの言語に変更したいときは再度言語を選択します

source: The system menus and many of the applications will now appear in the language chosen. If a specific program continues to display in English, then the program doesn't have a translation available - please consider volunteering to write a translation. Contact the program of interest directly for more information.
ja: 言語を選択すると、システムメニューと多くのアプリケーションが選択した言語で表示されます。特定のアプリケーションで英語が表示され続ける場合は、そのプラグラムで翻訳が利用できない状態になっています - ボランティアでの翻訳参加検討をお願いします。詳しくは興味のあるプログラムまで直接お問い合わせください。

source: For additional languages see :menuselection:`Preferences --> Language Support` from the main menu. (Requires an internet connection).
ja: その他の言語については、メインメニューから :menuselection:`Preferences --> Language Support` を確認してください。(インターネット接続が必要です)。

source: Keyboard Support
ja: キーボードサポート

source: International keyboard support is installed, but you will need to configure the system for your specific keyboard. To change settings open :menuselection:`Preferences --> Keyboard Input Methods` from the main menu and click on the :guilabel:`Input Method` tab. Next click on :guilabel:`Customize active input methods` and then on the :guilabel:`Select an input method` button. Now click the :guilabel:`Add` button on the right to add an additional layout and then :guilabel:`Close` the IBus Preferences window.
ja: 国際的なキーボードのサポートがインストールされていますが、特定のキーボード用にシステムを設定する必要があります。設定を変更するには、メインメニューから:menuselection:`Preferences-->Keyboard Input Methods`を開き、:guilabel:`Input Method`タブをクリックします。次に、:guilabel:`Customize active input methods`ボタンをクリックし、:guilabel:`Select an input method`ボタンをクリックします。次に右側の:guilabel:`Add`ボタンをクリックしてレイアウトを追加し、:guilabel:`Close`をクリックしてiBus 設定ウィンドウを閉じます。

source: You can now click on the keyboard icon on the lower desktop menu bar to select the active keyboard layout.
ja: これで、デスクトップ下部のメニュー上のキーボードアイコンをクリックし、アクティブなキーボードレイアウトを選択することができるようになりました。
